name = ("Gela") #ეს ცვლადი შეიცავს ჩემს სახელს და დაბეჭვდისას გამოიტანს Gela-ს და ეს ცვლადი string ტიპისაა
surname = ("Lomidze")  #ეს ცვლადი შეიცავს ჩემს გვარს და დაბეჭვდისას გამოიტანს Lomidze-ს და ეს ცვლადი string ტიპისაა
age = (13) #ეს ცვლადი შეიცავს ჩემს ასაკს და დაბეჭვდიასას გამოიტანს 13-ს და ეს ცვლადი int ტიპისაა

#ცვლადი არის ფუნქცია სადაც კომპიუტერი ინახავს მასში დაწერილ სიტყვას ან რიცხვს ან სხვა რამეს და გამოაქვს ეგ სიტყვა ან რიცხვი ან სხვა რამე დაბეჭვდისას

print(name)
print(surname)
print(age)

#print-ის დახმარებით ტერმინალზე კომპიუტერს გამოქვს ის სიტყვები რაც მაგ ცვლადებშია შენხახული