#აგუმენტი არის მნიშვნელობა რომელიც გადაეცემა ფუნქციას ფუნქციის გამოძახების დრო

#range ფუნქცია არის ფუნქცია რომლის საშუალებით ჩვენ შეგვიძლია მივუთითოთ თუ რამდენი რიცხვი ან სიტყვა გვინდა გამეორდეს.მაგალითად თუ 2-ს მივუთითებთ მაშინ ორჯერ გამოიტანს იდენტიკურ სიტყვას ან რიცხვს.

#range ფუნქციას შეგვიძლია მივუთითოთ სამი არგუმენტი:

#1)for i in range(5):
#   print(i)

#ამ დროს დაიბეჭდება რიცხვები 5-მდე ანუ 0,1,2,3,4. ეს არის start არგუმენტი

#2)ჩვენ შეგვიძლია მივუთითოთ მეორე არგუმენტიც:

#for i in range(5,10):
#   print(i)

#ამ დროს კონსოლზე გამოვა ის რიცხვები რომლებიც იწყება 5-დან და მთავრდება 10-მდე ანუ 5,6,7,8,9. ეს არის end არგუმენტი

#3)ასევე არის მესამე არგუმენტი

#for i in range(5,25,5):
#   print(i)

#ამ დროს კონსოლზე დაიბეჭდება რიხვები 5-დან 25-მდე 5-ის გამოტოვებით ანუ 5,10,15,20. ამ არგუმენტს ქვია step არგუმენტი.

#ანუ სულ არის სამი: start,end,step არგუმენტები range ფუნქციაში.