#case sensitive არის პითონი რაც იმას ნიშნავს რომ იგი განასხვავებს მაგალითად a და A-ს. პითონისთის ეგ სხვადასხვა რამეა ამიტომ როცა დავწერთ მაგალითად

#academy = "Goa"

#და

#Academy = "Goa"

#პითონისთვის ეგ ორი სულ სხვა ცვლადი იქნება და როცა დავაბეჭვდინებთ print ფუნქციის საშუალებით მაგას მაშინ გამოვა Goa ორჯერ

#case_insesitive არის როცა პროგრამირების ენა არ განასხვავებს a-სა და A-ს ანუ დიდ ასოს და პატარა ასოს რაც იმას ნიშნავს რომ თუ დავწერთ

#academy = "Goa"

#და

#Academy = "Goa"

#მაშინ დაიბეჭდება მხოლოდ ერთი Goa