# 1)განიხილეთ ეს კოდი (რას გამოიტანს):

# name = "vano"
# age = 0
# # print(name + "best")

# -------------------------------
# 2)კომენტარის გამოყენებით ახსენით რა არის კომენტარი + რისთვის გამოიყენება ის ასევე ახსენით რა არის დებაგიგნი

# -------------------------------
# 3)რა არის ამ კოდში შეცდომა (რომელ ხაზზე)

# name = "vano"
# surname = motiashvili
# height = 1 86
# print(name + surname - height)

# -------------------------------


#1)

#ეს კოდი არაფერს გამოიტანს რადგან პრინტის ფუნქცია დაკომენტარებულის და კომანტარებს კომპიუტერი აიგნორებს


#2)

#კომენტარი არის როცა ადამიანი ხსნის თავის კოდს და ახსნის მაგ კოდს სხვებისთვის რომ გაიგონ ეგ კოდი. კომენტარებს კომპიუტერი აგინორებს და არანაირ შეცდომას გამოიტანს ტერმინალზე. დებაგინგი არის როცა შენელებული კადრი სავით გვაჩვენებს ნაბიჯ-ნაბიჯ თუ როგორ აკეთებს და კითხულობს კომპიუტრერი დაწერილ კოდს.


#3)ამ კოდში შეცდომა არრის 3-ე ხაზზე ანუ height = 1 86 ეგ იმიტომ არის რომ გამოტოვება არის დაწერილი რიცხვებს შორის რაც არ შეიძლება და კომპიუტერი ერორს ამოაგდებს მაგის მაგივრად უნდა ეწეროს 186 გამოტოვების გარეშე რაც შეცდომა არ არისშ თუ მაგალითად ეგ იქნებოდა ბრჭყალებში ანუ string ტიპის თუ იქნებოდა მაშინ იგი შეცდომად არ ჩაითვლებოდა