#3)snake_case არის ქვედატირე რომელიც გამოიყენება გამოტოვების ადგილას რადგან გამოტოვებას როცა ვიყენებთ მაგალითად ცვლადში იგი ერორს გადმოგვცემს და snake_case როცა ვიყენებთ
#მაშინ არა.

#მაგალითდ

#cat name = "steve"
#print (cat name)     ეს კოდი გამოიტანს შეცდომას რადგან გამოტოვებაა გამოყეენებული და არ შეიძლება მაგის გამოყენება

#მაგის ადგილას უნდა იყოს ესე

#cat_name = "steve"
#print(cat_name)    #ეს უკვე სწორია ასევე შეგვიძლია არ გამოვიყენოთ snake_case და დავწეროთ catname მაგრამ ეგ ლამაზი არ არის და შეიძლება შეცდომაში შეგიყვანოს თუ არასწორად წაიკიტხე