name = ["gela" , "sandro" , "nika"]
index = 0

while index == 0:
    for i in name:
        print(i)
        index =+ 1
        if index == 5:
            break

# შევქმენით ორი ცვლადი ერთს მივანიჭეთ სია და მეორეს მნიშვნელობა რომელიც არის 0. მერე while ციკლის გამოყენებით სანამა index ცვლადი უდრის 0-ს მანამდე არ გაჩერდეს ეს ციკლი. მერე მაგ ციკლში შევქმნეით for ლუპი და ყოველი იტერაციის გაკეთებისას index ემატება 1. 5 იტერაციის შემდეგ index გაუტოლდება 5-ს და if-ის დახმარებით როცა index გაუტოლდება 5-ს მაშინ კოდი გაჩერდება.